<template>
  <div class="share_buttons">
    <div class="article_meta">
      <a class="share-twitter" :href="twitterUrl()" target="_blank" title="Xで共有">
        <svg xmlns="http://www.w3.org/2000/svg" width="1200" height="1227" viewBox="0 0 1200 1227" fill="none">
        <path class="fill_tw" d="M714.163 519.284L1160.89 0H1055.03L667.137 450.887L357.328 0H0L468.492 681.821L0 1226.37H105.866L515.491 750.218L842.672 1226.37H1200L714.137 519.284H714.163ZM569.165 687.828L521.697 619.934L144.011 79.6944H306.615L611.412 515.685L658.88 583.579L1055.08 1150.3H892.476L569.165 687.854V687.828Z"/>
        </svg><span>Xにポストする</span>
      </a>
    </div>
    <div class="article_meta">
      <a class="share-hatebu" :href="hatebuUrl()" target="_blank" title="はてなブックマークで共有">
        <svg xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink" width="355.004" height="300" viewBox="0 0 355.004 300">
          <g>
            <path class="fill_b" d="M280.009,0h70v200.005h-70V0z"/>
            <path class="fill_b" d="M215.192,160.596c-11.844-13.239-28.314-20.683-49.443-22.288 c18.795-5.122,32.443-12.616,41.077-22.628c8.593-9.88,12.856-23.292,12.856-40.171c0-13.362-2.922-25.184-8.579-35.397 c-5.805-10.152-14.14-18.276-25.102-24.357c-9.586-5.274-20.98-8.994-34.262-11.188c-13.349-2.126-36.709-3.198-70.231-3.198H0 V298.63h83.976c33.737,0,58.064-1.182,72.94-3.441c14.863-2.337,27.334-6.27,37.428-11.662 c12.484-6.587,22.007-15.964,28.662-28.01c6.698-12.085,10.014-26.02,10.014-41.956 C233.017,191.514,227.079,173.798,215.192,160.596z M75.26,67.27h17.398c20.108,0,33.617,2.267,40.59,6.787 c6.877,4.542,10.388,12.38,10.388,23.547c0,10.745-3.733,18.313-11.118,22.751c-7.483,4.354-21.117,6.562-41.079,6.562H75.26 V67.27z M144.276,237.733c-7.916,4.862-21.557,7.251-40.696,7.251H75.265v-64.949h29.54c19.654,0,33.243,2.475,40.469,7.414 c7.343,4.942,10.955,13.665,10.955,26.191C156.226,224.85,152.263,232.899,144.276,237.733z"/>
            <path class="fill_b" d="M315.014,220.003c-22.101,0-40.002,17.891-40.002,39.991 c0,22.1,17.902,40.006,40.002,40.006c22.072,0,39.99-17.906,39.99-40.006C355.004,237.894,337.088,220.003,315.014,220.003z"/>
          </g>
        </svg><span>はてブで共有する</span>
      </a>
    </div>
    <div class="article_meta">
      <a class="share-line" :href="lineUrl()" target="_blank" title="LINEで共有">
        <svg xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink" width="315px" height="300px" viewBox="0 0 315 300">
          <g>
            <path class="fill_li_1" d="M280.344,206.351 C280.344,206.351 280.354,206.351 280.354,206.351 C247.419,244.375 173.764,290.686 157.006,297.764 C140.251,304.844 142.724,293.258 143.409,289.286 C143.809,286.909 145.648,275.795 145.648,275.795 C146.179,271.773 146.725,265.543 145.139,261.573 C143.374,257.197 136.418,254.902 131.307,253.804 C55.860,243.805 0.004,190.897 0.004,127.748 C0.004,57.307 70.443,-0.006 157.006,-0.006 C243.579,-0.006 314.004,57.307 314.004,127.748 C314.004,155.946 303.108,181.342 280.344,206.351 Z"/>
            <path class="fill_li_2" d="M253.185,121.872 C257.722,121.872 261.408,125.569 261.408,130.129 C261.408,134.674 257.722,138.381 253.185,138.381,C253.185,138.381 230.249,138.381 230.249,138.381 C230.249,138.381 230.249,153.146 230.249,153.146 C230.249,153.146 253.185,153.146 253.185,153.146 C257.710,153.146 261.408,156.851 261.408,161.398 C261.408,165.960 257.710,169.660 253.185,169.660 C253.185,169.660 222.018,169.660 222.018,169.660 C217.491,169.660 213.795,165.960 213.795,161.398 C213.795,161.398 213.795,130.149 213.795,130.149 C213.795,130.139 213.795,130.139 213.795,130.129 C213.795,130.129 213.795,130.114 213.795,130.109 C213.795,130.109 213.795,98.878 213.795,98.878 C213.795,98.858 213.795,98.850 213.795,98.841 C213.795,94.296 217.486,90.583 222.018,90.583 C222.018,90.583 253.185,90.583 253.185,90.583 C257.722,90.583 261.408,94.296 261.408,98.841 C261.408,103.398 257.722,107.103 253.185,107.103 C253.185,107.103 230.249,107.103 230.249,107.103 C230.249,107.103 230.249,121.872 230.249,121.872 C230.249,121.872 253.185,121.872 253.185,121.872 ZM202.759,161.398 C202.759,164.966 200.503,168.114 197.135,169.236 C196.291,169.521 195.405,169.660 194.526,169.660 C191.956,169.660 189.502,168.431 187.956,166.354 C187.956,166.354 156.012,122.705 156.012,122.705 C156.012,122.705 156.012,161.398 156.012,161.398 C156.012,165.960 152.329,169.660 147.791,169.660 C143.256,169.660 139.565,165.960 139.565,161.398 C139.565,161.398 139.565,98.841 139.565,98.841 C139.565,95.287 141.829,92.142 145.192,91.010 C146.036,90.730 146.915,90.583 147.799,90.583 C150.364,90.583 152.828,91.818 154.366,93.894 C154.366,93.894 186.310,137.559 186.310,137.559 C186.310,137.559 186.310,98.841 186.310,98.841 C186.310,94.296 190.000,90.583 194.536,90.583 C199.073,90.583 202.759,94.296 202.759,98.841 C202.759,98.841 202.759,161.398 202.759,161.398 ZM127.737,161.398 C127.737,165.960 124.051,169.660 119.519,169.660 C114.986,169.660 111.300,165.960 111.300,161.398 C111.300,161.398 111.300,98.841 111.300,98.841 C111.300,94.296 114.986,90.583 119.519,90.583 C124.051,90.583 127.737,94.296 127.737,98.841 C127.737,98.841 127.737,161.398 127.737,161.398 ZM95.507,169.660 C95.507,169.660 64.343,169.660 64.343,169.660 C59.816,169.660 56.127,165.960 56.127,161.398 C56.127,161.398 56.127,98.841 56.127,98.841 C56.127,94.296 59.816,90.583 64.343,90.583 C68.881,90.583 72.564,94.296 72.564,98.841 C72.564,98.841 72.564,153.146 72.564,153.146 C72.564,153.146 95.507,153.146 95.507,153.146 C100.047,153.146 103.728,156.851 103.728,161.398 C103.728,165.960 100.047,169.660 95.507,169.660 Z"/>
          </g>
        </svg><span>LINEで送る</span>
      </a>
    </div>
  </div>
</template>

<script>
export default {
  name: "ShareButtons",
  props: ['title'],
  data() {
    return {
      url: `https://blog.udcxx.me${this.$route.path}`,
      twitter_url: "https://twitter.com/intent/tweet?url={0}&text={1}",
      hatebu_url: "http://b.hatena.ne.jp/add?mode=confirm&amp;url={0}&amp;title={1}",
      line_url: "https://social-plugins.line.me/lineit/share?url={0}"
    };
  },
  methods: {
    formatByArr(msg) {
      // フォーマット（引数可変（配列）版）
      var args = [];
      for (var i = 1; i < arguments.length; i++) {
        args[i - 1] = arguments[i];
      }
      // URLエンコード
      args = args.map(x => encodeURIComponent(x));
      return msg.replace(/\{(\d+)\}/g, function(m, k) {
        return args[k];
      });
    },
    // それぞれパラメータを埋め込む
    twitterUrl() {
      return this.formatByArr(this.twitter_url, this.url, this.title + ' - 無趣味の戯言');
    },
    hatebuUrl() {
      return this.formatByArr(this.hatebu_url, this.url, this.title);
    },
    lineUrl() {
      return this.formatByArr(this.line_url, this.url);
    }
  }
};
</script>

<style lang="scss">
.article_left {
    .share_buttons {
        width: 100%;

        .article_meta {
            width: 100%; height: 6.1rem;
            margin-top: 1rem;
            padding: 2rem;
            border-radius: 1rem;
            display: inline-flex;
            align-items: center;
            color: #2C2C2C;
            background-color: #D1D5D5;
            box-sizing: border-box;

            @media (max-width: 768px) {
                width: 54%; height: 100%;
                padding: 1.2rem 1.2rem 0.5rem;
                display: inline-block;

                &:nth-last-of-type(1) {
                    margin-right: 0;
                }
            }

            a {
                width: 100%; height: 100%;
                display: flex;
                align-items: center;

                @media (max-width: 768px) {
                    justify-content: center;
                }
            }

            svg {
                width: 2.4rem; height: 2.4rem;
                background-color: #D1D5D5;
                fill: #5a5a5a;
                display: inline-block;

                @media (max-width: 768px) {
                    width: 3rem; height: 3rem;
                }
            }

            span {
                padding-left: 1em;
                font-size: 1.6rem; font-weight: normal;
                color: #2C2C2C;

                @media (max-width: 768px) {
                    display: none;
                }
            }



            @media (max-width: 768px) {
                width: 6.1rem;
                padding: 0;
                margin-top: 0;
            }
        }

        .article_meta--title {
            margin-top: 1em;
            font-size: 1.6rem;

            &:nth-of-type(1) {
                margin-top: 0;
            }

            @media (max-width:768px) {
                display: none;
            }
        }

        .article_meta--content {
            text-align: right;
            font-size: 1.6rem;
            font-weight: bold;

            @media (max-width:768px) {
                text-align: left;
                font-size: 1.4rem;
            }
        }

        .share-twitter:hover {
            .fill_tw {
                fill: #000;
            }
        }

        .share-hatebu:hover {
            .fill_b {
                fill: #00A4DE;
            }
        }

        .share-line:hover {
            .fill_li_1 {
                fill: #00c300;
            }

            .fill_li_2 {
                fill: #ffffff;
            }
        }

        @media (max-width: 768px) {
            width: 21rem;
            padding-left: 1rem;
            display: flex;
            justify-content: space-between;
        }
    }
}
</style>
